
import pandas as pd
import streamlit as st
import matplotlib.pyplot as plt
import numpy as np
from sklearn.linear_model import LinearRegression
import joblib
import seaborn as sns
st.markdown(
    f"""
       <style>
       .stApp {{
           background-image: url("https://p0.pikist.com/photos/74/931/diamond-black-rich-brilliant-crystal-background-gem-object-facet.jpg");
           background-attachment: fixed;
           background-size: cover;
           /* opacity: 0.3; */
       }}
       </style>
       """,
    unsafe_allow_html=True
)
st.title('diamond Price Prediction')
st.image("mod5.jpeg")

st.sidebar.title('Preview')
diamond = st.sidebar.button('CARAT')

if diamond:
    with st.sidebar:
        st.video("https://www.youtube.com/watch?v=7YJm0eKZ6QM")

diamond1 = st.sidebar.button('COLOR')
if diamond1:
    with st.sidebar:
        st.video("https://www.youtube.com/watch?v=3RrjvSWvgEM")

diamond2 = st.sidebar.button('CLARITY')
if diamond2:
    with st.sidebar:
        st.video("https://www.youtube.com/watch?v=Lu6Ylu7uoR4")

diamond3 = st.sidebar.button('CUT')
if diamond3:
    with st.sidebar:
        st.video("https://www.youtube.com/watch?v=5P0987lVbRo")


tab1, tab2, tab3, tab4,tab5 = st.tabs(["HOME", "CARAT", "COLOR", "CLARITY", "CUT"])

with tab1:
    st.subheader("HOME")

    st.write("คำถามที่ใครๆก็สงสัยเวลาจะซื้อเพชรคือ “เพชรเม็ดนึงอะ กี่บาท และ ราคาเพชรที่เหมาะสมคือเท่าไร??” ซึ่งจริงๆแล้วคุณรู้หรือไม่ว่า เพชรนั้นมีราคาอ้างอิงกลางอยู่")
    st.write("ราคาอ้างอิงกลางคืออะไร และใครเป็นคนตั้งราคาเพชร?"
            " บางคนอาจจะเคยคิดว่าร้านแต่ละร้านนั้นตั้งราคาขายเองรึเปล่า เพชรนั้นราคามั่วหรือเปล่า หรือใครจะขายเท่าไรก็ได้ ซึ่งจริงๆแล้วเพชรนั้นมีราคาสากลอยู่ให้อ้างอิง ซึ่งราคาสากลที่ว่านี้มีชื่อว่า 'Rapaport Price List'"
             "Rapaport Price List คือตารางราคากลางของเพชรแต่เม็ด โดยมีตัวแปลที่สำคัญอยู่ที่ 3 อย่างคือ"
             "1.Carat (น้ำหนักเพชร)"
             "2.Color (สี, น้ำ)"
             "3.Clarity (ความสะอาด)"
             "4.Cut (การเจียระไน)")
    st.write("ตารางเพชรนี้ถูกคิดค้นโดยคนที่ชื่อว่า Martin Rapaport โดยการใช้หลักการณ์ demand supply ผนวกกับตลาดการซื้อขายจนได้รับการยอมรับจากวงการเพชรทั่วโลก ")
    st.image("mod1.jpg")
    st.write("โดยตาราง Rapaport จะ Update ราคาทุกวันศุกร์ เปลี่ยนแปลงบ้างเล็กน้อย ไม่เปลี่ยนแปลงบ้าง แล้วแต่สถานการณ์ในขณะนั้น แต่จะไม่ผันผวนเหมือนราคาทองราคากลางนี้สามารถนำมาเป็นอ้างอิงขั้นต้นกลางของราคาเพชรในแต่ละสเปค แต่ก็ไม่ใช่ว่าจะใช่ราคานี้เป๊ะๆ เพราะมีปัจจัยย่อยๆอื่นที่จะส่งผลต่อราคาเพชรอีก"
             " เช่นคุณภาพการเจียรไน, มีสารเรืองแสงหรือไม่, ขนาดพรีเมี่ยมต่างๆ หรือแม้กระทั่งยี่ห้อของสถาบันรับรองเพชร เป็นต้นเพชรที่ไม่ได้มีปัจจัยอื่นๆที่ดีนัก ก็อาจจะได้รับส่วนลด (ราคาต่ำกว่าราคากลาง) แต่เพชรที่มีปัจจัยคุณภาพที่ดีครบ หรือเป็นสเปคเพชรหายากก็จะมีพรีเมี่ยมราคา (ราคาสูงกว่าราคากลาง) ซึ่งก็เป็นเรื่องปกติเช่นกัน")

with tab2:
    st.subheader("CARAT")
    bp = st.image("https://www.amorizjewelry.com/wp-content/uploads/2021/08/Feature-Image-4C-Carats.png")
    st.title("ที่มาของคำว่า กะรัตเพชร")
    st.write("กะรัตเพชร (Carat) เป็นคำที่มีต้นกำเนิดมาจากคำว่า แครอบ (Carob) ซึ่งเป็นชื่อของพืชตระกูลถั่ว โดยเมล็ดของถั่วชนิดนี้เมื่อแห้งแล้ว ไม่ว่าเวลาจะผ่านไปนานเท่าใดก็ตาม มันก็ยังคงมีน้ำหนักคงที่ แต่ละเมล็ดมีน้ำหนักใกล้เคียงกันมากอย่างน่าอัศจรรย์ (ประมาณ 0.205 กรัม)")
    st.image("https://www.amorizjewelry.com/wp-content/uploads/2021/08/Carob-Seed.png")
    st.write("จากนั้นคำว่า Carob ก็ค่อยๆเพี้ยนมา จนกลายเป็นคำว่า Carat หรือ “กะรัต” ในที่สุดครับ และในการประชุมใหญ่สามัญว่าด้วยเรื่องน้ำหนักและมาตรวัด ครั้งที่ 4 (The Fourth General Conference on Weights and Measures) ในปี ค.ศ. 1907 ได้มีการกำหนดหน่วยวัดอย่างเป็นทางการ โดยให้น้ำหนัก 1 กะรัต เท่ากับ 0.2 กรัม ตั้งแต่นั้นเป็นต้นมา")
    st.title("การเรียก กะรัตเพชร แบบไทยไทย")
    st.write("ในกรณีที่เพชรมีน้ำหนักไม่ถึง 1 กะรัต ประเทศไทยของเราจะนิยมเรียกว่า ตังค์ ยกตัวอย่างเช่น")
    st.write("เพชร 0.30 กะรัต เรียกว่าเพชร 30 ตังค์")
    st.write("เพชร 0.40 กะรัต เรียกว่าเพชร 40 ตังค์")
    st.write("เพชร 0.50 กะรัต เรียกว่าเพชร 50 ตังค์")

with tab3:
    st.subheader("COLOR")
    bp = st.image("https://www.amorizjewelry.com/wp-content/uploads/2021/08/Feature-Image-4C-Colors.jpg")
    st.title("การเกิดสีในเพชร")
    st.write("ในตลาดเพชร เรามักจะพบเห็นเพชรมีสีขาวใสมากที่สุด นั้นเป็นเพราะเพชรส่วนใหญ่ไม่ดูดกลืนคลื่นแสงเอาไว้เลย ทำให้เรามองเห็นเพชรมีสีขาวใส แต่ก็มีบ้างที่เพชรดูดกลืนแสงบางส่วนเอาไว้ ทำให้เพชรมีสีต่างๆเพิ่มเติม เช่น สีเหลืองเข้ม สีส้ม สีน้ำตาล สีแดง สีชมพู สีม่วง สีเขียว สีฟ้า ไปจนถึงสีดำ เราจึงแบ่งสีเพชรออกได้เป็นสองกลุ่ม กลุ่มแรก Colorless Color คือเพชรสีขาวใส ไม่มีสี ไปจนถึงเพชรออกเหลืองอ่อนๆ และกลุ่มที่สอง Fancy Color คือเพชรสีอื่นๆทั้งหมด ที่ไม่ใช่สีขาวใส เราเรียกว่า เพชรแฟนซี (Fancy Diamond) ซึ่งเพชรแฟนซีนั้น มีความหายากมาก มีเพียงประมาณ 2% ของเพชรดิบทั้งหมดเท่านั้น หรือเพียง 1 ใน 10,000 กะรัต ของเพชรที่ใช้เป็นอัญมณี และมีโอกาสเพียง 1 ใน 25,000 กะรัต ที่จะพบว่ามีสีเข้มสวยงาม")
    bp = st.image("https://www.amorizjewelry.com/wp-content/uploads/2021/08/Multi-Color-Diamond.jpg")
    st.title("การจัดเกรดสีเพชร ในกลุ่ม Colorless")
    st.write("ด้วยเพชรสีขาวใสนั้นได้รับความนิยมสูงสุด  สถาบัน GIA  จึงได้เริ่มระบบการเกรดคุณภาพสีเพชรในกลุ่ม Colorless Color แบบไล่ตามตัวอักษร ตั้งแต่ช่วงปี ค.ศ.1950 – 1959 มาจนถึงปัจจุบัน และระบบนี้ก็ได้กลายมาเป็นมาตรฐานที่คนทั้งโลกต่างยอมรับ และใช้กันอย่างแพร่หลายโดยเริ่มจากตัวอักษร “D” เป็นตัวแรกในระบบ ถือเป็นเกรดสูงสุด (ขาวใสมากที่สุด) ไล่ตามลำดับ E, F, G… ไปเรื่อยๆ จนถึงตัวสุดท้ายในระบบ คือ “Z” จัดเป็นเกรดต่ำสุด (เพชรที่มีสีเหลืองอ่อน)")
    st.title("การเรียก สีเพชร แบบไทยไทย")
    st.write("ด้วยสถาบัน GIA ใช้ตัวอักษรภาษาอังกฤษ ในการกำหนดคุณภาพสีเพชร จึงอาจจะไม่ค่อยคุ้นชิ้นกับคนไทยเท่าไหร่นัก คนไทยจึงคิดวิธีเรียกสีเพชรขึ้นมาใหม่เป็นของตัวเอง โดยเรียกสีว่า “น้ำ” เริ่มจาก น้ำ 100 (D Color) แล้วไล่ลงไปตามลำดับ น้ำ 99, น้ำ 98, น้ำ 97, น้ำ 96… ลงไปเรื่อยๆ นั้นเองครับ ดังนั้นหากคุณได้ยินว่า เพชรน้ำ 100 หรือ เพชร D Color แท้จริงแล้ว คือความหมายเดียวกันนั้นเองครับผม")
    bp = st.image("https://www.amorizjewelry.com/wp-content/uploads/2021/08/Feature-Image-4C-Cut.png")

with tab4:
    st.subheader("CLARITY")
    bp = st.image("https://www.amorizjewelry.com/wp-content/uploads/2021/08/Feature-Image-4C-Clarity.png")
    st.title("ปัจจัยในการประเมิน ความสะอาดของเพชร")
    st.write("1. ขนาดของมลทิน (Size)ยิ่งมลทินมีขนาดใหญ่ หรือสามารถสังเกตได้ง่าย ก็จะยิ่งจัดว่าเพชรเม็ดนั้นๆ มีระดับความสะอาดต่ำ")
    st.write("2. จำนวนของมลทิน (Number)จำนวนในที่นี้หมายถึง จำนวนของมลทินที่สามารถ “มองเห็นได้ง่าย”  ว่ามีปริมาณมากน้อยแค่ไหน เพราะถ้ายิ่งมีน้อยก็จะทำให้ระดับความสะอาดสูงขึ้น กล่าวคือ เพชรเม็ดนั้นอาจจะมีมลทินภายในขนาดเล็กมากๆ เป็นจำนวนมาก แต่ยังคงได้ระดับความสะอาดที่สูงอยู่เพราะมองเห็นไม่ชัด เทียบกับเพชรอีกเม็ดมีมลทินภายในขนาดใหญ่เพียงแค่ 1 หรือ 2 จุด ก็จะทำให้ระดับความสะอาดลดลงเพราะเห็นได้ชัดกว่านั้นเอง")
    st.write("3. ตำแหน่งของมลทิน (Position)ตำแหน่งของมลทินนั้นส่งผลต่อการมองเห็นของเพชรได้ โดยมลทินที่อยู่บริเวณใต้หน้า Table จะสามารถมองเห็นได้ง่ายกว่ามลทินที่อยู่ใต้ Bezel หรือ ใกล้ๆ Girdle นอกจากนี้ ในเพชรบางเม็ดอาจมีมลทินขนาดเล็กไม่สะดุดตา แต่ถ้าอยู่ในตำแหน่งที่ทำให้เกิดการสะท้อนในหน้าเจียระไน ทำให้มองเห็นเหมือนว่ามีมลทินหลายจุดกว่าความเป็นจริง โดยเรียกเหตุการณ์ในลักษณะนี้ว่า ภาพสะท้อน (Reflector) ซึ่งเจ้าภาพสะท้อนนี้จะทำให้ระดับความสะอาดของเพชรลดลงมากกว่ามลทินที่ไม่เกิดการสะท้อน")
    bp = st.image("https://www.amorizjewelry.com/wp-content/uploads/2021/08/Anatomy-Of-A-Diamond.png")
    st.write("4. สี และ รีลิฟ (Color and Relief)ความแตกต่างระหว่างตัวมลทินกับเนื้อของเพชร โดยมลทินที่มีความสว่างมากๆ มืดมากๆ หรือมีสีต่างๆ ก็จะยิ่งง่ายในการมองเห็น ซึ่งจะมีผลต่อระดับความสะอาดมากกว่ามลทินที่ใสไม่มีสี")
    st.write("5. ชนิดของมลทิน (Nature or Type)ชนิดของมลทิน และผลกระทบต่อความคงทนเพชร เช่น ความผิดปกติในโครงสร้างของผลึก จะมีผลต่อความสะอาดน้อยกว่าการแตกทางกายภาพของเพชร หรือรอยแตกขนาดเล็กๆ แต่ลึกมากๆ คือแตกจาก Crown ไปจนถึง Pavilion ก็จะส่งผลต่อความคงทนของเพชรได้มาก และทำให้ได้ระดับความสะอาดที่ต่ำตามไปด้วย")


with tab5:
    st.subheader("CUT")
    bp = st.image("https://www.amorizjewelry.com/wp-content/uploads/2021/08/Feature-Image-4C-Cut.png")
    st.title("3 คุณสมบัติสำคัญในการตัดเกรด การเจียระไนเพชร")
    st.write("1. สัดส่วนของเพชร (Cut Grade)")
    st.write("การเจียระไนเพชรที่สมบูรณ์แบบ ในทุกๆสัดส่วนของเพชรต้องเหมาะสม ไม่ควรมีหน้าเพชรกว้าง หรือแคบจนเกินไป ความสูงของเพชร ก็ต้องไม่ลึกหรือตื้นจนเกินไป ตลอดจนขอบเพชร (Girdle) ต้องไม่หนาและไม่บางจนเกินไป และเมื่อเจียระไนเพชรได้สัดส่วนที่สมบูรณ์แบบ จะส่งผลให้เกิด")
    st.write("ไฟ (Fire) คือ การกระเจิงของแสงออกมาให้เห็นเป็น “สีรุ้ง”")
    st.write("ความแวววาว (Scintillation) คือ ความมืด-สว่างที่เกิดจากการสะท้อนของแสงภายในตัวเพชร")
    st.write("ประกาย (Brilliance) คือ ความสว่างจากแสงขาวที่สะท้อนออกมาจากพื้นผิวภายนอกและภายในตัวเพชร")
    bp = st.image("https://www.amorizjewelry.com/wp-content/uploads/2021/08/Anatomy-of-Diamond-Cut.png")
    st.title("โดยสัดส่วนของเพชร จะพิจารณาจากสิ่งดังต่อไปนี้")
    st.title("Table")
    st.write("Table คือ หน้าเพชร ซึ่งเป็นหน้าเจียระไนที่ใหญ่ที่สุด ทำหน้าที่เสมือนหน้าต่างให้มองเห็นภายในเนื้อเพชร โดยหน้า Table และหน้าที่อยู่บริเวณ Crown จะประกอบกันทำให้เกิดเป็นมุมต่างๆ ซึ่งเป็นตัวให้แสงผ่านเข้า-ออกเพชรนั่นเองซึ่ง Table วัดได้โดยการหารความกว้างของหน้าเพชร (พื้นที่บนหน้าเพชร) ด้วยความยาวศูนย์กลางของเพชร (วัดจากซ้ายสุดไปขวาสุด) โดยเปอร์เซ็นต์ของหน้า Table ที่ดีที่สุดสำหรับเพชรกลม (Round Brilliant Cut) คือ อยู่ในช่วง 55 ถึง 65%")
    st.title("Crown")
    st.write("สัดส่วนของหน้า Crown จะส่งผลถึงความงาม และความคงทนของเพชร ประกอบไปด้วย “Crown Angle” และ “Crown Height”")
    st.write("Crown Angle คือ มุมระหว่างหน้า Bezel กับระนาบของ Girdle")
    st.write("Crown Height คือ ระยะห่างจากระนาบ Girdle ถึงหน้า Table")
    st.write("หากผลึกดิบของเพชรมีลักษณะแบน จะทำให้ได้เพชรที่มี Crown Angle ตื้น เนื่องจากช่างเจียระไนจะต้องพยายามรักษาน้ำหนักให้มากที่สุด โดยเพชรที่มีมุมของ Crown ตื้น มีแนวโน้มที่จะมีหน้า Table ใหญ่ ขอบ Girdle บาง และมี Pavilion ตื้นตามไปด้วย ซึ่งสัดส่วนแบบนี้จะส่งผลต่อความสวยงามและความคงทนของเพชร โดยเฉพาะอย่างยิ่งเมื่อนำไปขึ้นตัวเรือนในขณะเดียวกันเพชรกลม (Round Brilliant Cut) ที่มี Crown Angle ชัน มักจะมีหน้า Table เล็ก และหน้า Crown สูง ซึ่งการที่มี Crown สูงจะทำให้เพชรมีน้ำหนักมากขึ้น ฉะนั้นการซื้อเพชรลักษณะนี้ จึงเป็นการจ่ายเพิ่มให้กับน้ำหนักที่เพิ่มขึ้นเท่านั้น")
    st.title("Girdle")
    st.write("สำหรับเพชรที่เจียระไนดีนั้น จะต้องมีความหนาของ Girdle ที่พอดี ไม่บางไป และไม่หนาไป เพชรที่มี Girdle หนาเกินไป ก็จะทำให้เกิดภาพสะท้อนเป็นสีเทาในเพชรได้ ในขณะที่ถ้า Girdle บางเกินไปจะส่งผลต่อความคงทน โดยเพชรอาจจะเกิดการบิ่นในระหว่างการขึ้นตัวเรือน หรือเมื่อสวมใส่ในชีวิตประจำวันได้")
    st.title("Pavilion")
    st.write("Pavilion เป็นส่วนที่ทำให้แสงที่เข้ามาจากด้านบน สะท้อนกลับไปยังหน้า Crown เกิดเป็น Brilliance นอกจากนี้ Pavilion ยังเป็นส่วนที่ทำให้เกิดการกระเจิงของแสงกลายเป็น สีรุ้ง หรือ ไฟ (Fire) อีกด้วย")
    bp = st.image("https://www.amorizjewelry.com/wp-content/uploads/2021/08/Nailhead-and-Fisheye-Diamond.png")
    st.title("Culet")
    st.write("Culet คือ ส่วนที่อยู่ก้นพลอย เป็นบริเวณที่หน้า Pavilion Main มาบรรจบกัน จุดประสงค์ของการมี Culet คือ เพื่อป้องกันรอยขีดข่วนและการบิ่นบนเพชรร่วง โดยไม่จำเป็นต้องมีในเพชรทุกเม็ด หาก Culet ใหญ่เกินไป จะทำให้เห็นเป็นจุดสีดำเมื่อมองจากหน้า Table ")

    st.title("2. การขัดเงา (Polish)")
    st.write("การขัดเงาที่สมบูรณ์แบบ ต้องทำให้ผิวเพชรมีความเรียบเนียน สม่ำเสมอ ไม่มีผิวขรุขระ เม็ดทราย และไม่ทิ้งร่องรอยการเจียระไนไว้ (Polish lines) ทำให้แสงที่ตกกระทบลงไปในเพชรเดินทางได้ดี ทำให้เพชรสวยงามมากยิ่งขึ้น หากเพชรมีการขัดเงาได้ไม่ดี เพชรก็จะดูด้านๆ ขมุกขมัว ถึงแม้เพชรเม็ดนั้นจะมีสัดส่วนที่ดีก็ตามเนื่องจากเพชรเป็นอัญมณีที่มีความแข็งมากที่สุด เพชรจึงสามารถเจียระไนได้ดีกว่าอัญมณีชนิดอื่น แต่อย่างไรก็ตามกระบวนการเจียระไนยัง สามารถทำให้เกิดตำหนิบนผิวของเพชรได้ เช่น Polish Line และ Polish Markโดย Polish Line จะเป็นร่องรอยที่เหลืออยู่จากการเจียระไน ส่วน Polish Mark นั้นเกิดจากการเจียระไนที่เร็วเกินไปทำให้หน้าที่ถูกเจียระไนนั้นไหม้ เห็นเป็นหมอกสีขาวๆนอกจากนี้ในทิศทางที่เจียระไนได้ยาก มักจะทำให้เกิดร่องและคลื่นบนพื้นผิวของหน้าเจียระไน หรืออาจจะมีลักษณะเป็นตุ่มเล็กๆ ซึ่งเรียกว่า “Lizard skin” ซึ่งตำหนิจากการเจียระไนนี้ มักพบได้ทั่วไปบริเวณ Girdle ของเพชร โดย Girdle ที่ว่าหยาบนี้จะมีลักษณะเป็นเม็ดๆ คล้ายกับก้อนน้ำตาลเกาะ หรือ อาจจะมี Nick เล็กๆ ที่กินเข้าไปบริเวณ Crown หรือ Pavilion ได้ นอกจากนี้ยังมีลักษณะขรุขระ (Bearded) ร่วมกับรอยแตกเล็กๆ จากพื้นผิวด้านนอกเข้าไปในเนื้อเพชรได้")
    st.image("https://www.amorizjewelry.com/wp-content/uploads/2021/08/Types-of-External-Diamond-Blemish.png")

    st.title("3. ความมีสมมาตร (Symmetry)")
    st.write("ความสมมาตรที่สมบูรณ์แบบ ทั้งด้านซ้ายด้านขวา รวมถึงเหลี่ยมทุกเหลี่ยม ต้องมีความเท่าเทียมกัน เมื่อมองจากมุมต่างๆ เพชรที่มีสมมาตร แสงจะตกกระทบตามองศาได้อย่างถูกต้อง ทำให้สะท้อนประกายได้อย่างสวยงาม")


data= sns.load_dataset("diamonds")
model = LinearRegression()
st.write("Shape of a dataset", data.shape)
x = np.array(data["carat"]).reshape(-1, 1)
y = np.array(data["price"]).reshape(-1, 1)
model.fit(x, y)
value = st.number_input("carat", 0.20, 1000.01, step=0.15)
value = np.array(value).reshape(1, -1)
prediction = model.predict(value)[0]
if st.button("price Prediction($)"):
    st.write(f"{prediction}")



def save_model(model):
    joblib.dump(model, 'model.joblib')

def load_diamond_data():
    return pd.read_sns('diamond2.xls')

def load_model():
    return joblib.load('model.joblib')

left, right = st.columns(2)

trainb = left.button('train แบบจำลองประเมินราคา')
if trainb:
    right.write('training model ...')
    df = pd.read_excel('diamond2.xls', index_col=0)
    st.dataframe(df)
    model = LinearRegression()
    model.fit(df.x.values.reshape(-1,1), df.y)
    left.write('... done')
    #left.dataframe(df)
    save_model(model)

loadb = right.button('load diamond2.xls')
if loadb:
    right.write('loading "diamond2.xls ..."')
    df = pd.read_excel('diamond2.xls', index_col=-1)
    st.dataframe(df)
    right.write('... done')
    #right.dataframe(df)
    fig, ax = plt.subplots()
    df.plot.scatter( x='carat', y='price', ax=ax )
    st.pyplot(fig)








